In [2]:
import numpy as np
import pandas as pd

In [3]:
np.nan

nan

In [4]:
pd.NA

In [5]:
df= pd.read_csv('C:\\Users\\piyus\\Downloads\\Udemy Notebooks\\DATA\\movie_scores.csv')

                  count   mean       std   min   25%   50%    75%   max
age                 4.0  52.75  15.88238  31.0  46.0  57.0  63.75  66.0
pre_movie_score     3.0   7.00   1.00000   6.0   6.5   7.0   7.50   8.0
post_movie_score    3.0   9.00   1.00000   8.0   8.5   9.0   9.50  10.0

In [9]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [10]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [18]:
df[(df['pre_movie_score'].isnull()) & (df['first_name'].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [21]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [26]:
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [27]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [28]:
df.fillna('Empty Val')

  first_name  last_name        age        sex pre_movie_score post_movie_score
0        Tom      Hanks       63.0          m             8.0             10.0
1  Empty Val  Empty Val  Empty Val  Empty Val       Empty Val        Empty Val
2       Hugh    Jackman       51.0          m       Empty Val        Empty Val
3      Oprah    Winfrey       66.0          f             6.0              8.0
4       Emma      Stone       31.0          f             7.0              9.0

In [29]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [31]:
df['pre_movie_score'].fillna(0,inplace=True)

In [33]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              0.0               NaN
2       Hugh   Jackman  51.0    m              0.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [34]:
df['pre_movie_score'].replace(to_replace=0.0,value=df['pre_movie_score'].mean())

0    8.0
1    4.2
2    4.2
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [44]:
netflix = {'Free':7,'Basic':10,'Standard':np.nan,'Premium':20}

In [45]:
ser = pd.Series(netflix)

In [46]:
ser

Free         7.0
Basic       10.0
Standard     NaN
Premium     20.0
dtype: float64

In [47]:
ser.interpolate()

Free         7.0
Basic       10.0
Standard    15.0
Premium     20.0
dtype: float64